---
kind: method
id: M:Autodesk.Revit.DB.SubTransaction.#ctor(Autodesk.Revit.DB.Document)
source: html/45a22e3e-a4b0-ed07-ac79-3196ccfe9da7.htm
---
# Autodesk.Revit.DB.SubTransaction.#ctor Method

Instantiates a sub-transaction object

## Syntax (C#)
```csharp
public SubTransaction(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document for which this sub-transaction is going to be used.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null